Repository: shinta0806/NicoKaraMaker3Translation
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# SettingsAddOnPage_CheckBoxRunSubtitleActionSelector.Content
source: Automatically set actions
zh_cn: 自动设置动作

# SettingsAddOnPage_TextBlockAddOnIndex.Text
source: Setting method:
zh_cn: 设置方法：

# SettingsAddOnPage_TextBlockContinue.Text
source: After the initial setup, proceed with the following steps.
zh_cn: 完成初始设置后，请按照以下步骤操作。

# SettingsAddOnPage_TextBlockSettings.Text
source: Settings
zh_cn: 设置

# SettingsAddOnPageCharFadeInFadeOutControl_CheckBoxDelayInlineGraphics.Content
source: Delay the fade-out of inline graphics
zh_cn: 延迟内嵌图形淡出

source: When using inline graphics as icons to separate lyric parts, enabling this option will make them easier to see.
zh_cn: 将内嵌图形用作分隔歌词部分的图标时， 启用此选项可以让图标更清晰。

# SettingsAddOnPageCharFadeInFadeOutControl_CheckBoxWholeFadeOut.Content
source: The display fades out based on the end time (similar to a fade-in effect)
zh_cn: 显示画面将根据结束时间逐渐淡出（类似于淡入效果）

# SettingsAddOnPageCharFadeInFadeOutControl_TextBlockIntroDelay.Text
source: Time difference between the beginning and end:
zh_cn: 开始与结束之间的时间差：

# SettingsAddOnPageCharFadeInFadeOutControl_TextBlockTailDelay.Text
source: Time until the last character of a line begins to disappear:
zh_cn: 距离行末字符开始消失的时间：

# SettingsAddOnPageEmptyLineBreakerControl_TextBlockDescription.Text
source: The paragraph break setting will be determined based on the following settings.
zh_cn: 段落分隔的设置将根据以下设置确定。

# SettingsAddOnPageLineFadeControl_TextBlockFadeInTime.Text
source: Time until fade-in is complete:
zh_cn: 淡入完成时间：

# SettingsAddOnPageLineFadeControl_TextBlockFadeOutTime.Text
source: Time until fade-out is complete:
zh_cn: 淡出完成时间：

# SettingsAddOnPageLinesLayoutSelectorControl_TextBlockBegin.Text
source: Applicable layout (from):
zh_cn: 适用布局（从）：

# SettingsAddOnPageLinesLayoutSelectorControl_TextBlockDescription.Text
source: The layout will be selected from the options within the above range.
zh_cn: 布局将从上述范围内的选项中进行选择。

# SettingsAddOnPageLinesLayoutSelectorControl_TextBlockEnd.Text
source: (to):
zh_cn: （到）：

# SettingsAddOnPageNoSettingsControl_TextBlockNoSettings.Text
source: (No settings available)
zh_cn: （没有可用设置）

# SettingsAddOnPagePartFontSelectorControl_CheckBoxAutoChorus.Content
source: Automatically color-codes the chorus portion of the lyrics
zh_cn: 自动为歌词中的合唱部分分配颜色

source: Maintain even when the line changes
zh_cn: 换行后仍保持

# SettingsAddOnPagePartFontSelectorControl_CheckBoxLyricsCharToFont.Content
source: Apply the font setting with the same name as the lyrics
zh_cn: 应用与歌词同名的字体设置

# SettingsAddOnPagePartFontSelectorControl_HyperlinkButtonHelp.Content
source: Detailed information
zh_cn: 详细信息

# SettingsAddOnPagePartFontSelectorControl_TextBlockAutoChorusBeginChars.Text
source: Chorus start character:
zh_cn: 合唱开始字符：

# SettingsAddOnPagePartFontSelectorControl_TextBlockAutoChorusEndChars.Text
source: Chorus end character:
zh_cn: 合唱结束字符：

# SettingsAddOnPagePartFontSelectorControl_TextBlockChorusFont.Text
source: Chorus Font:
zh_cn: 合唱字体：

# SettingsAddOnPageSeqLinesBreakerControl_TextBlockDescription.Text
source: The paragraph break setting will be determined based on the following settings.
zh_cn: 段落分隔的设置将根据以下设置确定。

# SettingsAddOnPageSeqLinesBreakerControl_TextBlockSeq.Text
source: Number of lines to set the page break:
zh_cn: 分页行数：

# SettingsAddOnPageSlideUpDownControl_CheckBoxFadeIn.Content
source: Fade in
zh_cn: 淡入

# SettingsAddOnPageSlideUpDownControl_CheckBoxFadeOut.Content
source: Fade out
zh_cn: 淡出

# SettingsAddOnPageSlideUpDownControl_TextBlockFadeDetail.Text
source: Fade advanced settings
zh_cn: 淡入淡出高级设置

# SettingsAddOnPageSlideUpDownControl_TextBlockSlideAmountDescription.Text
source: (Slide down if positive, up if negative)
zh_cn: （正值向下滑动，负值向上滑动）

# SettingsAddOnPageSlideUpDownControl_TextBlockSlideAmountSize.Text
source: Vertical slide amount:
zh_cn: 垂直滑动量：

# SettingsAddOnPageTopShortAdjusterControl_CheckBoxManualProtectTime.Content
source: Manually set the display protection time when the switching time is short *For advanced users
zh_cn: 当切换时间较短时，手动设置显示保护时间 *适用于高级用户

# SettingsAddOnPageTopShortAdjusterControl_TextBlockIntervalTime2.Text
source: Lyric display interval:
zh_cn: 歌词显示间隔：

# SettingsAddOnPageTopShortAdjusterControl_TextBlockManualProtectTime.Text
source: Display protection time:
zh_cn: 显示保护时间：

# SettingsAddOnPageTopShortAdjusterControl_TextBlockPostTime2.Text
source: Display time after wipe:
zh_cn: 走字后显示时间：

# SettingsAddOnPageTopShortAdjusterControl_TextBlockPreTime2.Text
source: Display time before wipe:
zh_cn: 走字前显示时间：

source: Please keep the display time before and after the wipe to less than or equal to the display time before and after the wipe.
zh_cn: 请将走字前后的显示时间控制在保护时间以内。

# SettingsAddOnPageTopShortAdjusterControl_TextBoxPostTime2.ToolTipService.ToolTip
source: If the action is Utopia, setting the display time after the wipe to 1000 [ms] or more will make the movement of the end of the line look nicer.
zh_cn: 如果动作是“逐字纷飞”，将走字后显示时间设为 1000 [ms] 以上，可让行末飞出效果更自然。

# SettingsAddOnPageUnificationFontSelectorControl_TextBlockFont.Text
source: Font to use:
zh_cn: 使用字体：

# SettingsAddOnPageUnificationLayoutSelectorControl_TextBlockLayout.Text
source: Layout to use:
zh_cn: 使用布局：

source: Edit subtitle actions...
zh_cn: 编辑字幕动作...

source: Subtitle action to use:
zh_cn: 使用的字幕动作：

# SettingsAddOnPageUtopiaControl_CheckBoxDelayInlineGraphics.Content
source: Delay the fade-out of inline graphics
zh_cn: 延迟内嵌图形淡出

source: When using inline graphics as icons for dividing lyrics into parts, enabling this option will make them easier to see.
zh_cn: 将内嵌图形用作分隔歌词部分的图标时， 启用此选项可以让图标更清晰。

# SettingsAddOnPageUtopiaControl_TextBlockTailDelay.Text
source: Time until the last character of a line begins to disappear:
zh_cn: 距离一行最后一个字符开始消失的时间：

# SettingsAddOnPageViewModel_ButtonDefaultClicked_Confirm
source: We will reset all settings to their default values. Are you sure?
zh_cn: 将所有设置重置为默认值。 确定吗？

# ShowTimeAdjusterPageViewModel_PageDescription
source: Automatically sets the display start and end times for all rows.
zh_cn: 自动设置所有行的显示开始和结束时间

# ShowTimeAdjusterPageViewModel_Title
source: Automatically set the display start and end time
zh_cn: 自动设置显示开始和结束时间

# SlideUpDown_Description
source: Slide the entire row up or down
zh_cn: 让整行向上或向下滑动

# SlideUpDown_Name
source: Up and down slide
zh_cn: 上下滑动

# SpinFlip_Description
source: Each letter spins and flips
zh_cn: 每个字符都会旋转并翻转

# SpinFlip_Name
source: Spin flip
zh_cn: 旋转翻转

# SplashPage_TextBlockStarting.Text
source: Starting up...
zh_cn: 启动中...

# SubtitleActionSelectorPageViewModel_PageDescription
source: Automatically sets the action for all rows.
zh_cn: 自动为所有行设置动作。

# SubtitleActionSelectorPageViewModel_Title
source: Automatically set actions
zh_cn: 自动设置动作

# TitleInfoControl_ButtonEditShowTime.ToolTipService.ToolTip
source: Edit display time...
zh_cn: 编辑显示时间...

# TitleInfoControl_TableViewColumnFont.Header
source: Font
zh_cn: 字体

# TitleInfoControl_TableViewColumnSubtitleAction.Header
source: Actions
zh_cn: 动作

# TitleInfoControl_TableViewColumnTitle.Header
source: Title
zh_cn: 标题

# TitleInfoControl_TextBlockLayout.Text
source: Layout:
zh_cn: 布局：

# TitleInfoControl_TextBlockShowTime.Text
source: Display time:
zh_cn: 显示时间：

# ToastHistoryPage_TextBlockDescription.Text
source: This displays the history, including cases where notifications are turned off in the settings or OS settings.
zh_cn: 此处显示历史记录，包括在应用设置或操作系统设置中关闭通知的情况。

# TopLongAdjuster_Description
source: To make the connection with the lyrics in the lower section clearer, the lyrics in the upper section are displayed for as long as possible. The timing of the middle section will change depending on the vertical arrangement of the layout. This is the same standard setting method as the display time in the original Nicokara Karaoke Video Maker.
zh_cn: 为了让上方歌词与下方歌词的衔接更清楚，上方歌词会尽可能长时间显示。 中间部分的时机会根据布局的垂直排列而变化。 这与原版 Nicokara Karaoke Video Maker 的显示时间标准设置方法相同。

# TopLongAdjuster_Name
source: Display the lyrics in the upper section in a longer format
zh_cn: 上方歌词同步退场

# TopShortAdjuster_Description
source: To avoid interfering with the background video, the lyrics at the top will be wiped away and then quickly removed.
zh_cn: 为了避免遮挡背景视频，上方歌词会在走字后迅速消失。

# TopShortAdjuster_Name
source: Quickly erase the lyrics in the upper section
zh_cn: 上方歌词快速退场

# UnificationFontSelector_Description
source: Unify everything to the same font.
zh_cn: 将所有内容统一为同一字体。

# UnificationFontSelector_Name
source: Use the same font for everything
zh_cn: 所有内容都使用同一字体

# UnificationLayoutSelector_Description
source: Unify everything to the same layout.
zh_cn: 将所有内容统一为相同的布局。

# UnificationLayoutSelector_Name
source: Use the same layout for everything
zh_cn: 所有内容都采用相同的布局

# UnificationSubtitleActionSelector_Description
source: Unify everything to the same action.
zh_cn: 将所有内容统一为同一动作。

# UnificationSubtitleActionSelector_Name
source: Unify everything to the same action
zh_cn: 所有内容都使用同一动作

# Utopia_Description
source: The text after the wipe fades away, twisting as it goes
zh_cn: 走字后的文字会缩放并飞出

# Utopia_Name
source: Utopia
zh_cn: 逐字纷飞

source: Warning
zh_cn: 警告

# WarningsPage_ToggleButtonInformations.ToolTipService.ToolTip
source: Show information
zh_cn: 显示信息

# WarningsPage_ToggleButtonWarnings.ToolTipService.ToolTip
source: Show warning
zh_cn: 显示警告

source: Yes
zh_cn: 是
